#### Customers

' customer_id,customer_name,age,email
1,Alice Smith,34,alice@example.com
2,Bob Johnson,28,bob@example.com
3,Charlie Davis,40,charlie@example.com
4,Diana Evans,22,diana@example.com
5,Ella Thompson,35,ella@exmaple.in '

#### Orders
order_id,customer_id,order_amount,order_date
101,1,250,2024-01-15
102,2,150,2024-01-18
103,1,300,2024-01-20
104,3,500,2024-01-25
105,5,100,2024-01-28

In [49]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

*** Practice Tasks: <br>
Load the Data: Read the customers and orders CSV files using Pandas.

In [80]:
import pandas as pd
df_customers = pd.read_csv('customers.csv')
df_orders = pd.read_csv('orders.csv')
df=titanic


Select Specific Columns: Extract customer names and ages. <br><br>
__Filter Rows:__ Find customers older than 30 years.<br>
__Join Tables:__ Merge the customers and orders tables based on customer_id.<br>
__Group and Aggregate:__ Calculate the total order amount for each customer.<br>
__Sort:__ Sort customers by the total order amount in descending order.<br>
__Handle Missing Data:__ Find customers who don’t have an email address.<br>
__Create New Columns:__ Add a column for age in 5 years.<br>
__Rename Columns:__ Change the customer_name column to name.<br>
__Remove Duplicates:__ Remove duplicate customer names.<br>

### 1. Importing Data (Equivalent to SELECT *)
Goal: Load data from a file, similar to querying all data from a table.

SQL Query:

```SELECT * FROM customers;```

In [51]:
#Pandas Equivalent:
 
import pandas as pd
df_customers = pd.read_csv('customers.csv')
df_orders = pd.read_csv('orders.csv')
#Explanation:

#pd.read_csv() reads data from a CSV file and loads it into a DataFrame. 
#This is like pulling all data from a table in SQL.

In [52]:
df_customers.head(3)

   customer_id  customer_name  age                email
0            1    Alice Smith   34    alice@example.com
1            2    Bob Johnson   28      bob@example.com
2            3  Charlie Davis   40  charlie@example.com

In [91]:
df_orders.values

array([[101, 1, 250, '2024-01-15'],
       [102, 2, 150, '2024-01-18'],
       [103, 1, 300, '2024-01-20'],
       [104, 3, 500, '2024-01-25'],
       [105, 5, 100, '2024-01-28']], dtype=object)

In [90]:
df.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

### 2. SELECT Specific Columns
Goal: Select specific columns from a dataframe.

SQL Query: <br>
```SELECT customer_name, age FROM customers;```

In [15]:
#Pandas Equivalent:
df_customers[['customer_name', 'age']]

# Explanation:
# This method is used to explicitly select one or more columns from a DataFrame. 
# It’s a straightforward and most common way to access specific columns by their names.

   customer_name  age
0    Alice Smith   34
1    Bob Johnson   28
2  Charlie Davis   40
3    Diana Evans   22
4  Ella Thompson   35

In [33]:
# or
# Select columns using filter
df_filtered = df_customers.filter(['customer_name', 'age'])
df_filtered
#df_filtered = df_customers.filter(like='name','age', axis=1)
# It selects specific rows or columns based on labels or patterns, 
#such as column names that contain a certain string or match a regular expression.

   customer_name  age
0    Alice Smith   34
1    Bob Johnson   28
2  Charlie Davis   40
3    Diana Evans   22
4  Ella Thompson   35

In [112]:
#Or
# Select columns that contain the string "name"
df_filtered = df_customers.get('customer_name') 
df_filtered=df_filtered.to_frame()
df_filtered


# df.get('column_name', 'default_value') 
# get() is a dictionary-style accessor in Pandas, mostly used for 
# safely accessing columns without raising a KeyError if the column doesn’t exist.
# If the column isn’t found, it returns None or a specified default value.

   customer_name
0    Alice Smith
1    Bob Johnson
2  Charlie Davis
3    Diana Evans
4  Ella Thompson

### 3. Filtering Rows (Equivalent to WHERE Clause)
Goal: Filter rows based on specific conditions.

SQL Query:<br>
```SELECT * FROM customers WHERE age > 30;```

In [34]:
# Pandas Equivalent:
df_customers[df_customers['age'] > 30]

# Explanation:
# In Pandas, filtering is done by passing a condition inside square brackets ([]).

   customer_id  customer_name  age                email
0            1    Alice Smith   34    alice@example.com
2            3  Charlie Davis   40  charlie@example.com
4            5  Ella Thompson   35      ella@example.in

In [201]:
# Apply multiple conditions and fetch specific columns
x=df[(df['fare'] > 40) & ((df.age <10) | (df['age'] >60))] [['age','fare','who', 'embark_town']]
x.shape
x.head()

       age      fare    who  embark_town
43    3.00   41.5792  child    Cherbourg
54   65.00   61.9792    man    Cherbourg
275  63.00   77.9583  woman  Southampton
297   2.00  151.5500  child  Southampton
305   0.92  151.5500  child  Southampton

In [205]:
x=df[(df['fare']<=df['age']) & (df['age']>60)] [['age','fare','who', 'embark_town']]
x.head(5)

      age     fare  who  embark_town
33   66.0  10.5000  man  Southampton
54   65.0  61.9792  man    Cherbourg
96   71.0  34.6542  man    Cherbourg
116  70.5   7.7500  man   Queenstown
170  61.0  33.5000  man  Southampton

In [202]:
x = df[(df.age <= df.fare) & (df.age > 60)][['age', 'fare']]
x.head(4)

      age      fare
275  63.0   77.9583
438  64.0  263.0000
745  70.0   71.0000
829  62.0   80.0000

In [211]:
x = df.query('age == fare and age < 60')[['age', 'fare']]
x

      age  fare
38   18.0  18.0
312  26.0  26.0

In [213]:
x.concat('i')

AttributeError: 'DataFrame' object has no attribute 'concat'

### 4. Sorting Data (Equivalent to ORDER BY)
Goal: Sort data based on column values.

SQL Query:

```SELECT * FROM customers ORDER BY age asc,customer_id DESC;```

In [38]:
# Pandas Equivalent:
df_customers.sort_values(by=['age', 'customer_id'], ascending=[True, False])

# Explanation:
# sort_values() is used to sort the dataframe by the specified column. You can specify ascending=False for descending order.

   customer_id  customer_name  age                email
3            4    Diana Evans   22    diana@example.com
1            2    Bob Johnson   28      bob@example.com
0            1    Alice Smith   34    alice@example.com
4            5  Ella Thompson   35      ella@example.in
2            3  Charlie Davis   40  charlie@example.com

### 5. Aggregating Data (Equivalent to GROUP BY and Aggregation)
Goal: Group data by a column and perform aggregation, like SUM or COUNT.

SQL Query: 
```SELECT customer_name, COUNT(*) FROM customers GROUP BY customer_name;```

In [41]:
# Pandas Equivalent:

df_customers.groupby('customer_name').size().reset_index(name='count')

# Explanation:
# groupby() groups the data by the specified column.
# size() counts the number of occurrences in each group.

   customer_name  count
0    Alice Smith      1
1    Bob Johnson      1
2  Charlie Davis      1
3    Diana Evans      1
4  Ella Thompson      1

### 6. Joining DataFrames (Equivalent to JOIN)
Goal: Join two DataFrames, similar to an SQL JOIN.

SQL Query:
```SELECT * FROM customers c JOIN orders o ON c.customer_id = o.customer_id;```

<figure class="table">
    <table>
        <thead>
            <tr>
                <th>Method</th>
                <th>Purpose</th>
                <th>Common Use Cases</th>
            </tr>
        </thead>
        <tbody>
            <tr>
                <td><strong>Merge</strong></td>
                <td>Combine DataFrames based on common columns or keys (like SQL JOINs).</td>
                <td>When you need to combine datasets with related information based on key columns.</td>
            </tr>
            <tr>
                <td><strong>Join</strong></td>
                <td>Combine DataFrames based on their indices.</td>
                <td>When joining two DataFrames where one or both are indexed.</td>
            </tr>
            <tr>
                <td><strong>Concat</strong></td>
                <td>Concatenate DataFrames along a particular axis (vertically or horizontally).</td>
                <td>When you want to stack DataFrames either vertically (adding rows) or horizontally (adding columns).</td>
            </tr>
        </tbody>
    </table>
</figure>
<h3>When to Use Each:</h3>
<ul>
    <li>Use <code><strong>merge()</strong></code> when you need to combine DataFrames based on keys.</li>
    <li>Use <code><strong>join()</strong></code> when you want to combine DataFrames based on their indices.</li>
    <li>Use <code><strong>concat()</strong></code> when you want to stack multiple DataFrames together, either row-wise or column-wise just like __UNION ALL__</li>
</ul>

In [215]:
# Pandas Equivalent:

df_merged = df_customers.merge(df_orders, on='customer_id')
# Explanation:

# merge() joins two DataFrames on a specified column. The on parameter is equivalent to the SQL ON condition.

### 7. Handling Missing Data (Equivalent to IS NULL)
Goal: Detect and handle missing values.

SQL Query: 
```SELECT * FROM customers WHERE email IS NULL;```

In [72]:
# Pandas Equivalent:
 
df_customers[df_customers['email'].isnull()]
# Explanation:

# isnull() checks for NaN values (missing data in Pandas).

Empty DataFrame
Columns: [customer_id, customer_name, age, email]
Index: []

### 8. Adding a New Column (Equivalent to Calculated Fields)
Goal: Add a new calculated column to the dataframe.

SQL Query:
```
SELECT customer_name, age, age + 5 AS age_in_5_years FROM customers;
    ```

In [73]:
# Pandas Equivalent:

df_customers['age_in_5_years'] = df_customers['age'] + 5
# Explanation:

# In Pandas, you can create new columns by simple operations on existing columns.

### 9. Renaming Columns (Equivalent to AS in SQL)
Goal: Rename columns in a dataframe.

SQL Query:
```
SELECT customer_name AS name, age AS customer_age FROM customers;
```

In [75]:
# Pandas Equivalent:
df_customers.rename(columns={'customer_name': 'name', 'age': 'customer_age'}, inplace=True)
# Explanation:

# rename() allows you to rename one or more columns.

### 10. Removing Duplicates (Equivalent to DISTINCT)
Goal: Remove duplicate rows.

SQL Query:
```
SELECT DISTINCT customer_name FROM customers;
```

In [216]:
# Pandas Equivalent:
df_customers[['customer_name']].drop_duplicates()
# Explanation:

# drop_duplicates() removes duplicate rows based on the specified columns.

   customer_name
0    Alice Smith
1    Bob Johnson
2  Charlie Davis
3    Diana Evans
4  Ella Thompson

In [ ]:
df_customers.to_csv('/directory/customers.csv', index=False)

In [45]:
#case when

In [47]:
df.case_when(caselist=[(a.gt(0), a),  # condition, replacement

SyntaxError: incomplete input (347973099.py, line 1)